src/main/resources/user-request.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:us="http://example.com/spring-boot-soap-example">

	<soapenv:Header />
	<soapenv:Body>
		<us:getUserRequest>
			<us:name>RAM</us:name>
		</us:getUserRequest>
	</soapenv:Body>
</soapenv:Envelope>